import firebase_admin
from firebase_admin import credentials,firestore

cred = credentials.Certificate("serviceAccountKey.json")
firebase_admin.initialize_app(cred)

db = firestore.client()

docs = [
{
  "地點": "北勢東路",
  "時段": "早餐",
  "店家名稱": "The san",
  "地址": "台中市沙鹿區北勢東路480號",
  "營業時間": "6:00~13:00",
  "評價": "4.7顆星",
  "類型": "韓式"
},

{
  "地點": "北勢東路",
  "時段": "早餐",
  "店家名稱": "告胖早午餐",
  "地址": "台中市沙鹿區北勢東路568號",
  "營業時間": "6:00~14:00",
  "評價": "4顆星",
  "類型": "西式"
},

{
  "地點": "北勢東路",
  "時段": "早餐",
  "店家名稱": "禎麻吉中西式早午餐",
  "地址": "台中市沙鹿區台灣大道7段231號",
  "營業時間": "05:45~13:00",
  "評價": "4.2顆星",
  "類型": "中西式"
},

{
  "地點": "北勢東路",
  "時段": "早餐",
  "店家名稱": "貪食早餐",
  "地址": "台中市沙鹿區自立路336-1號",
  "營業時間": "6:00~13:00",
  "評價": "4顆星",
  "類型": "西式"
},

{
  "地點": "北勢東路",
  "時段": "午餐",
  "店家名稱": "楊記牛肉麵",
  "地址": "台中市沙鹿區北勢東路311號",
  "營業時間": "11:00~14:00(一休)",
  "評價": "4.3顆星",
  "類型": "中式"
},

{
  "地點": "北勢東路",
  "時段": "午餐",
  "店家名稱": "櫃森森複合式餐廳",
  "地址": "台中市沙鹿區北勢東路800號",
  "營業時間": "11:00~14:00(一、四公休)",
  "評價": "4.2顆星",
  "類型": "中式"
},

{
  "地點": "北勢東路",
  "時段": "午餐",
  "店家名稱": "田福鑫安",
  "地址": "台中市沙鹿區北勢東路758號B棟",
  "營業時間": "11:00~19:00(二、四公休)",
  "評價": "4.2顆星",
  "類型": "中式"
},

{
  "地點": "北勢東路",
  "時段": "晚餐",
  "店家名稱": "初曉",
  "地址": "台中市沙鹿區北勢東路562號",
  "營業時間": "11:00~21:30",
  "評價": "4.5顆星",
  "類型": "日式"
},

{
  "地點": "北勢東路",
  "時段": "晚餐",
  "店家名稱": "富賦號",
  "地址": "台中市沙鹿區北勢東路500號",
  "營業時間": "17:00~24:00",
  "評價": "4.1顆星",
  "類型": "日式"
},

{
  "地點": "北勢東路",
  "時段": "晚餐",
  "店家名稱": "雙甲韓食",
  "地址": "台中市沙鹿區北勢東路758號A棟",
  "營業時間": "17:00~20:30(二、四公休)",
  "評價": "5顆星",
  "類型": "韓式"
},

{
  "地點": "沙鹿火車站",
  "時段": "早餐",
  "店家名稱": "ㄚ如早餐店",
  "地址": "台中市沙鹿區中山路254號",
  "營業時間": "5:30~10:30",
  "評價": "4.6顆星",
  "類型": "西式"
},

{
  "地點": "沙鹿火車站",
  "時段": "早餐",
  "店家名稱": "植上早午餐",
  "地址": "台中市沙鹿區大同街34-1號",
  "營業時間": "６:00~13:15",
  "評價": "4.3顆星",
  "類型": "西式"
},

{
  "地點": "沙鹿火車站",
  "時段": "早餐",
  "店家名稱": "無名爌肉飯",
  "地址": "台中市沙鹿區中正路80-1號",
  "營業時間": "3:00~10:30",
  "評價": "4.2顆星",
  "類型": "中式"
},

{
  "地點": "沙鹿火車站",
  "時段": "午餐",
  "店家名稱": "忍者壽司",
  "地址": "台中市沙鹿區四平街新平巷6-1號",
  "營業時間": "11:30~14:00(二、四公休)",
  "評價": "4.4顆星",
  "類型": "日式"
},

{
  "地點": "沙鹿火車站",
  "時段": "午餐",
  "店家名稱": "沙鹿肉圓福",
  "地址": "台中市沙鹿區鎮南路二段636號",
  "營業時間": "8:00~18:30",
  "評價": "4顆星",
  "類型": "中式"
},

{
  "地點": "沙鹿火車站",
  "時段": "午餐",
  "店家名稱": "潮日麵鋪",
  "地址": "台中市沙鹿區中正街58-2號",
  "營業時間": "11:00~14:00",
  "評價": "4.5顆星",
  "類型": "日式"
},

{
  "地點": "沙鹿火車站",
  "時段": "晚餐",
  "店家名稱": "台北魷魚羹",
  "地址": "台中市沙鹿區中正街52號",
  "營業時間": "10:00~23:00",
  "評價": "4.2顆星",
  "類型": "中式"
},

{
  "地點": "沙鹿火車站",
  "時段": "晚餐",
  "店家名稱": "拉仔麵",
  "地址": "台中市沙鹿區文昌街51號",
  "營業時間": "11:00~19:30",
  "評價": "3.9顆星",
  "類型": "中式"
},

{
  "地點": "沙鹿火車站",
  "時段": "晚餐",
  "店家名稱": "紅毛肉麵",
  "地址": "台中市沙鹿區和平街1號",
  "營業時間": "10:00~19:30",
  "評價": "4.6顆星",
  "類型": "中式"
},

{
  "地點": "靜宜校內",
  "時段": "早餐",
  "店家名稱": "Morning house",
  "地址": "靜宜大學 靜園餐廳",
  "營業時間": "平日: 6:30~20:00/假日: 公休",
  "評價": "3.9顆星",
  "類型": "西式"
},

{
  "地點": "靜宜校內",
  "時段": "早餐",
  "店家名稱": "早安山丘",
  "地址": "靜宜大學 宜園餐廳",
  "營業時間": "平日: 7:00~20:00/假日: 7:00~13:00(周日公休)",
  "評價": "4.2顆星",
  "類型": "日式"
},

{
  "地點": "靜宜校內",
  "時段": "早餐",
  "店家名稱": "永和豆漿",
  "地址": "靜宜大學 宜園餐廳",
  "營業時間": "平日: 7:00~20:00/假日: 7:00~13:00(周日公休)",
  "評價": "4.2顆星",
  "類型": "中式"
},

{
  "地點": "靜宜校內",
  "時段": "早餐",
  "店家名稱": "米樂",
  "地址": "靜宜大學 至善餐廳",
  "營業時間": "平日: 6:00~21:30/假日: 7:00~21:00",
  "評價": "4顆星",
  "類型": "西式"
},

{
  "地點": "靜宜校內",
  "時段": "午餐",
  "店家名稱": "炸雞大師",
  "地址": "靜宜大學 宜園餐廳",
  "營業時間": "平日: 7:00~20:00/假日: 7:00~13:00(周日公休)",
  "評價": "4.2顆星",
  "類型": "中式"
},

{
  "地點": "靜宜校內",
  "時段": "午餐",
  "店家名稱": "聖明自助餐",
  "地址": "靜宜大學 宜園餐廳",
  "營業時間": "平日: 7:00~20:00/假日: 7:00~13:00(周日公休)",
  "評價": "4.2顆星",
  "類型": "中式"
},

{
  "地點": "靜宜校內",
  "時段": "午餐",
  "店家名稱": "馨饌坊",
  "地址": "靜宜大學 至善餐廳",
  "營業時間": "平日: 6:00~21:30/假日: 7:00~21:00",
  "評價": "4顆星",
  "類型": "中式"
},

{
  "地點": "靜宜校內",
  "時段": "午餐",
  "店家名稱": "左撇子",
  "地址": "靜宜大學 靜園餐廳",
  "營業時間": "平日: 6:30~20:00/假日: 公休",
  "評價": "3.9顆星",
  "類型": "中式"
},

{
  "地點": "靜宜校內",
  "時段": "晚餐",
  "店家名稱": "yami快餐",
  "地址": "靜宜大學 至善餐廳",
  "營業時間": "平日: 6:00~21:30/假日: 7:00~21:00",
  "評價": "4顆星",
  "類型": "中式"
},

{
  "地點": "靜宜校內",
  "時段": "晚餐",
  "店家名稱": "全家",
  "地址": "靜宜大學 至善餐廳",
  "營業時間": "平日: 6:00~21:30/假日: 7:00~21:00",
  "評價": "4顆星",
  "類型": "西式"
},

{
  "地點": "靜宜校內",
  "時段": "晚餐",
  "店家名稱": "買辣",
  "地址": "靜宜大學 至善餐廳",
  "營業時間": "平日: 6:00~21:30/假日: 7:00~21:00",
  "評價": "4顆星",
  "類型": "中式"
}

]



collection_ref = db.collection("食物")
for doc in docs:
  collection_ref.add(doc)

